@chenrui333 I just want to say thank you for putting in some support for the ns1 provider.

Looks like my monitoring jobs were imported correctly but my `ns1_zone` resources have `zone` arguments like `asdjasldjasldas239448329042309`. I believe these should be reserved for the `id` argument. If I run 

```
cd generated/zone
terraform plan
```

It seems to fail after terraformer generates the values.

If I manually create a `ns1_zone` and import it.

```
resource "ns1_zone" "example" {
  zone = "terraform.example.io"
  ttl  = 600
}
```

Then run 

```
terraform import ns1_zone.example snip.com
terraform plan
```

```
-/+ resource "ns1_zone" "example" {
        autogenerate_ns_record = true
      ~ dns_servers            = "snip" -> (known after apply)
      ~ dnssec                 = snip -> (known after apply)
      ~ expiry                 = snip -> (known after apply)
      ~ hostmaster             = "snip" -> (known after apply)
      ~ id                     = "asdjasldjasldas239448329042309" -> (known after apply)
      ~ networks               = [
          - 0,
        ] -> (known after apply)
      ~ nx_ttl                 = snip -> (known after apply)
      ~ refresh                = snip -> (known after apply)
      ~ retry                  = snip -> (known after apply)
      ~ ttl                    = snip -> snip
      ~ zone                   = "snip" -> "terraform.example.io" # forces replacement
    }
```